regular_items = {'比赛序号': 0, '日期': 1, '年龄': 2, '主队': 3, '主客场': 4,
                 '对手': 5, '赛果': 6, '是否首发': 7, '上场时间': 8, '命中数': 9,
                 '出手数': 10, '命中率': 11, '三分球命中数': 12, '三分球出手数': 13,
                 '三分球命中率': 14, '罚球命中数': 15, '罚球出手数': 16,
                 '罚球命中率': 17, '前场篮板': 18, '后场篮板': 19, '篮板': 20,
                 '助攻': 21, '抢断': 22, '盖帽': 23, '失误': 24, '犯规': 25,
                 '得分': 26, '比赛评分': 27, '正负值': 28}    # 29

playoff_items = {'比赛序号': 0, '日期': 1, '轮次': 2, '主队': 3, '主客场': 4,
                 '对手': 5, '本轮比赛序号': 6, '赛果': 7, '是否首发': 8,
                 '上场时间': 9, '命中数': 10, '出手数': 11, '命中率': 12,
                 '三分球命中数': 13, '三分球出手数': 14, '三分球命中率': 15,
                 '罚球命中数': 16, '罚球出手数': 17, '罚球命中率': 18, '前场篮板': 19,
                 '后场篮板': 20, '篮板': 21, '助攻': 22, '抢断': 23, '盖帽': 24,
                 '失误': 25, '犯规': 26, '得分': 27, '比赛评分': 28, '正负值': 29}

regular_items_2000 = {'比赛序号': 0, '日期': 1, '年龄': 2, '主队': 3, '主客场': 4,
                      '对手': 5, '赛果': 6, '是否首发': 7, '上场时间': 8, '命中数': 9,
                      '出手数': 10, '命中率': 11, '三分球命中数': 12, '三分球出手数': 13,
                      '三分球命中率': 14, '罚球命中数': 15, '罚球出手数': 16,
                      '罚球命中率': 17, '前场篮板': 18, '后场篮板': 19, '篮板': 20,
                      '助攻': 21, '抢断': 22, '盖帽': 23, '失误': 24, '犯规': 25,
                      '得分': 26, '比赛评分': 27}    # 28项

playoff_items_2000 = {'比赛序号': 0, '日期': 1, '轮次': 2, '主队': 3, '主客场': 4,
                      '对手': 5, '本轮比赛序号': 6, '赛果': 7, '是否首发': 8,
                      '上场时间': 9, '命中数': 10, '出手数': 11, '命中率': 12,
                      '三分球命中数': 13, '三分球出手数': 14, '三分球命中率': 15,
                      '罚球命中数': 16, '罚球出手数': 17, '罚球命中率': 18, '前场篮板': 19,
                      '后场篮板': 20, '篮板': 21, '助攻': 22, '抢断': 23, '盖帽': 24,
                      '失误': 25, '犯规': 26, '得分': 27, '比赛评分': 28}

regular_items_1979 = {'比赛序号': 0, '日期': 1, '年龄': 2, '主队': 3, '主客场': 4,
                      '对手': 5, '赛果': 6, '是否首发': 7, '上场时间': 8, '命中数': 9,
                      '出手数': 10, '命中率': 11, '罚球命中数': 12, '罚球出手数': 13,
                      '罚球命中率': 14, '前场篮板': 15, '后场篮板': 16, '篮板': 17,
                      '助攻': 18, '抢断': 19, '盖帽': 20, '失误': 21, '犯规': 22,
                      '得分': 23, '比赛评分': 24}    # 25项

playoff_items_1979 = {'比赛序号': 0, '日期': 1, '轮次': 2, '主队': 3, '主客场': 4,
                      '对手': 5, '本轮比赛序号': 6, '赛果': 7, '是否首发': 8,
                      '上场时间': 9, '命中数': 10, '出手数': 11, '命中率': 12,
                      '罚球命中数': 13, '罚球出手数': 14, '罚球命中率': 15, '前场篮板': 16,
                      '后场篮板': 17, '篮板': 18, '助攻': 19, '抢断': 20, '盖帽': 21,
                      '失误': 22, '犯规': 23, '得分': 24, '比赛评分': 25}

regular_items_1977 = {'比赛序号': 0, '日期': 1, '年龄': 2, '主队': 3, '主客场': 4,
                      '对手': 5, '赛果': 6, '是否首发': 7, '上场时间': 8, '命中数': 9,
                      '出手数': 10, '命中率': 11, '罚球命中数': 12, '罚球出手数': 13,
                      '罚球命中率': 14, '前场篮板': 15, '后场篮板': 16, '篮板': 17,
                      '助攻': 18, '抢断': 19, '盖帽': 20, '犯规': 21, '得分': 22}    # 23项

playoff_items_1977 = {'比赛序号': 0, '日期': 1, '轮次': 2, '主队': 3, '主客场': 4,
                      '对手': 5, '本轮比赛序号': 6, '赛果': 7, '是否首发': 8,
                      '上场时间': 9, '命中数': 10, '出手数': 11, '命中率': 12,
                      '罚球命中数': 13, '罚球出手数': 14, '罚球命中率': 15, '前场篮板': 16,
                      '后场篮板': 17, '篮板': 18, '助攻': 19, '抢断': 20, '盖帽': 21,
                      '犯规': 22, '得分': 23}

regular_items_1973 = {'比赛序号': 0, '日期': 1, '年龄': 2, '主队': 3, '主客场': 4,
                      '对手': 5, '赛果': 6, '是否首发': 7, '上场时间': 8, '命中数': 9,
                      '出手数': 10, '命中率': 11, '罚球命中数': 12, '罚球出手数': 13,
                      '罚球命中率': 14, '篮板': 15, '助攻': 16, '犯规': 17, '得分': 18}    # 19项

playoff_items_1973 = {'比赛序号': 0, '日期': 1, '轮次': 2, '主队': 3, '主客场': 4,
                      '对手': 5, '本轮比赛序号': 6, '赛果': 7, '是否首发': 8,
                      '上场时间': 9, '命中数': 10, '出手数': 11, '命中率': 12,
                      '罚球命中数': 13, '罚球出手数': 14, '罚球命中率': 15,
                      '篮板': 16, '助攻': 17, '犯规': 18, '得分': 19}

'''
2000-01赛季开始统计正负值
1979-80赛季开始统计三分球命中数、三分球出手数、三分球命中率
1977-78赛季开始统计失误、比赛评分
1973-74赛季开始统计前场篮板、后场篮板、抢断、盖帽
'''