en2ch = {'G': '比赛序号', 'Date': '日期', 'Age': '年龄', 'Tm': '主队', 'RoH': '主客场',
         'Opp': '对手', 'WoL': '赛果', 'GS': '是否首发', 'MP': '上场时间', 'FG': '命中数',
         'FGA': '出手数', 'FG%': '命中率', '3P': '三分球命中数', '3PA': '三分球出手数',
         '3P%': '三分球命中率', 'FT': '罚球命中数', 'FTA': '罚球出手数', 'Series': '轮次',
         'FT%': '罚球命中率', 'ORB': '前场篮板', 'DRB': '后场篮板', 'TRB': '篮板',
         'AST': '助攻', 'STL': '抢断', 'BLK': '盖帽', 'TOV': '失误', 'PF': '犯规', 'Diff': '比赛分差',
         'PTS': '得分', 'GmSc': '比赛评分', '+/-': '正负值', 'Playoffs': '日期', 'G#': '本轮比赛序号'}

regular_items_en = {'G': 0, 'Date': 1, 'Age': 2, 'Tm': 3, 'RoH': 4, 'Opp': 5, 'WoL': 6, 'GS': 7, 'MP': 8, 'FG': 9,
                    'FGA': 10, 'FG%': 11, '3P': 12, '3PA': 13, '3P%': 14, 'FT': 15, 'FTA': 16, 'FT%': 17, 'ORB': 18,
                    'DRB': 19, 'TRB': 20, 'AST': 21, 'STL': 22, 'BLK': 23, 'TOV': 24, 'PF': 25, 'PTS': 26, 'GmSc': 27,
                    '+/-': 28}

playoff_items_en = {'G': 0, 'Playoffs': 1, 'Series': 2, 'Tm': 3, 'RoH': 4, 'Opp': 5, 'G#': 6, 'WoL': 7, 'GS': 8,
                    'MP': 9, 'FG': 10, 'FGA': 11, 'FG%': 12, '3P': 13, '3PA': 14, '3P%': 15, 'FT': 16, 'FTA': 17,
                    'FT%': 18, 'ORB': 19, 'DRB': 20, 'TRB': 21, 'AST': 22, 'STL': 23, 'BLK': 24, 'TOV': 25, 'PF': 26,
                    'PTS': 27, 'GmSc': 28, '+/-': 29}

playoff_items = {'G': '比赛序号', 'Date': '日期', 'Age': '年龄', 'Tm': '主队', 'RoH': '主客场',
                 'Opp': '对手', 'WoL': '赛果', 'GS': '是否首发', 'MP': '上场时间', 'FG': '命中数',
                 'FGA': '出手数', 'FG%': '命中率', '3P': '三分球命中数', '3PA': '三分球出手数',
                 '3P%': '三分球命中率', 'FT': '罚球命中数', 'FTA': '罚球出手数',
                 'FT%': '罚球命中率', 'ORB': '前场篮板', 'DRB': '后场篮板', 'TRB': '篮板',
                 'AST': '助攻', 'STL': '抢断', 'BLK': '盖帽', 'TOV': '失误', 'PF': '犯规',
                 'PTS': '得分', 'GmSc': '比赛评分', '+/-': '正负值'}

regular_items_2000 = {'比赛序号': 0, '日期': 1, '年龄': 2, '主队': 3, '主客场': 4,
                      '对手': 5, '赛果': 6, '是否首发': 7, '上场时间': 8, '命中数': 9,
                      '出手数': 10, '命中率': 11, '三分球命中数': 12, '三分球出手数': 13,
                      '三分球命中率': 14, '罚球命中数': 15, '罚球出手数': 16,
                      '罚球命中率': 17, '前场篮板': 18, '后场篮板': 19, '篮板': 20,
                      '助攻': 21, '抢断': 22, '盖帽': 23, '失误': 24, '犯规': 25,
                      '得分': 26, '比赛评分': 27}    # 28项

playoff_items_2000 = {'比赛序号': 0, '日期': 1, '轮次': 2, '主队': 3, '主客场': 4,
                      '对手': 5, '本轮比赛序号': 6, '赛果': 7, '是否首发': 8,
                      '上场时间': 9, '命中数': 10, '出手数': 11, '命中率': 12,
                      '三分球命中数': 13, '三分球出手数': 14, '三分球命中率': 15,
                      '罚球命中数': 16, '罚球出手数': 17, '罚球命中率': 18, '前场篮板': 19,
                      '后场篮板': 20, '篮板': 21, '助攻': 22, '抢断': 23, '盖帽': 24,
                      '失误': 25, '犯规': 26, '得分': 27, '比赛评分': 28}

regular_items_1979 = {'比赛序号': 0, '日期': 1, '年龄': 2, '主队': 3, '主客场': 4,
                      '对手': 5, '赛果': 6, '是否首发': 7, '上场时间': 8, '命中数': 9,
                      '出手数': 10, '命中率': 11, '罚球命中数': 12, '罚球出手数': 13,
                      '罚球命中率': 14, '前场篮板': 15, '后场篮板': 16, '篮板': 17,
                      '助攻': 18, '抢断': 19, '盖帽': 20, '失误': 21, '犯规': 22,
                      '得分': 23, '比赛评分': 24}    # 25项

playoff_items_1979 = {'比赛序号': 0, '日期': 1, '轮次': 2, '主队': 3, '主客场': 4,
                      '对手': 5, '本轮比赛序号': 6, '赛果': 7, '是否首发': 8,
                      '上场时间': 9, '命中数': 10, '出手数': 11, '命中率': 12,
                      '罚球命中数': 13, '罚球出手数': 14, '罚球命中率': 15, '前场篮板': 16,
                      '后场篮板': 17, '篮板': 18, '助攻': 19, '抢断': 20, '盖帽': 21,
                      '失误': 22, '犯规': 23, '得分': 24, '比赛评分': 25}

regular_items_1977 = {'比赛序号': 0, '日期': 1, '年龄': 2, '主队': 3, '主客场': 4,
                      '对手': 5, '赛果': 6, '是否首发': 7, '上场时间': 8, '命中数': 9,
                      '出手数': 10, '命中率': 11, '罚球命中数': 12, '罚球出手数': 13,
                      '罚球命中率': 14, '前场篮板': 15, '后场篮板': 16, '篮板': 17,
                      '助攻': 18, '抢断': 19, '盖帽': 20, '犯规': 21, '得分': 22}    # 23项

playoff_items_1977 = {'比赛序号': 0, '日期': 1, '轮次': 2, '主队': 3, '主客场': 4,
                      '对手': 5, '本轮比赛序号': 6, '赛果': 7, '是否首发': 8,
                      '上场时间': 9, '命中数': 10, '出手数': 11, '命中率': 12,
                      '罚球命中数': 13, '罚球出手数': 14, '罚球命中率': 15, '前场篮板': 16,
                      '后场篮板': 17, '篮板': 18, '助攻': 19, '抢断': 20, '盖帽': 21,
                      '犯规': 22, '得分': 23}

regular_items_1973 = {'比赛序号': 0, '日期': 1, '年龄': 2, '主队': 3, '主客场': 4,
                      '对手': 5, '赛果': 6, '是否首发': 7, '上场时间': 8, '命中数': 9,
                      '出手数': 10, '命中率': 11, '罚球命中数': 12, '罚球出手数': 13,
                      '罚球命中率': 14, '篮板': 15, '助攻': 16, '犯规': 17, '得分': 18}    # 19项

playoff_items_1973 = {'比赛序号': 0, '日期': 1, '轮次': 2, '主队': 3, '主客场': 4,
                      '对手': 5, '本轮比赛序号': 6, '赛果': 7, '是否首发': 8,
                      '上场时间': 9, '命中数': 10, '出手数': 11, '命中率': 12,
                      '罚球命中数': 13, '罚球出手数': 14, '罚球命中率': 15,
                      '篮板': 16, '助攻': 17, '犯规': 18, '得分': 19}

'''
2000-01赛季开始统计正负值
1979-80赛季开始统计三分球命中数、三分球出手数、三分球命中率
1977-78赛季开始统计失误、比赛评分
1973-74赛季开始统计前场篮板、后场篮板、抢断、盖帽
'''