regular_items = {'比赛序号': 0, '日期': 1, '年龄': 2, '主队': 3, '主客场': 4,
                 '对手': 5, '赛果': 6, '是否首发': 7, '上场时间': 8, '命中数': 9,
                 '出手数': 10, '命中率': 11, '三分球命中数': 12, '三分球出手数': 13,
                 '三分球命中率': 14, '罚球命中数': 15, '罚球出手数': 16,
                 '罚球命中率': 17, '前场篮板': 18, '后场篮板': 19, '篮板': 20,
                 '助攻': 21, '抢断': 22, '盖帽': 23, '失误': 24, '犯规': 25,
                 '得分': 26, '比赛评分': 27, '正负值': 28}
playoff_items = {'比赛序号': 0, '日期': 1, '轮次': 2, '主队': 3, '主客场': 4,
                 '对手': 5, '本轮比赛序号': 6, '赛果': 7, '是否首发': 8,
                 '上场时间': 9, '命中数': 10, '出手数': 11, '命中率': 12,
                 '三分球命中数': 13, '三分球出手数': 14, '三分球命中率': 15,
                 '罚球命中数': 16, '罚球出手数': 17, '罚球命中率': 18, '前场篮板': 19,
                 '后场篮板': 20, '篮板': 21, '助攻': 22, '抢断': 23, '盖帽': 24,
                 '失误': 25, '犯规': 26, '得分': 27, '比赛评分': 28, '正负值': 29}
'''
2000-01赛季开始统计+/-值
1979-80赛季开始统计三分球命中数、三分球出手数、三分球命中率
1977-78赛季开始统计失误、比赛评分
1973-74赛季开始统计前场篮板、后场篮板、抢断、盖帽
'''